# SetPlanarRef

## Description
Set the plane ref ID of the specified object.

```pascal
PROCEDURE SetPlanarRef(
				h     : HANDLE;
				refID : LONGINT);
```

```python

def vs.SetPlanarRef(h, refID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to the object.|
|refID|LONGINT|Reference ID of the plane.|

## Version
Availability: from Vectorworks 2011
## Category
* Object Info